Repository: Thisara404/buslanka-mobile-app-V1.5
Catalog: Frontend/to_do/lib/l10n/app_*.arb
Languages: si

# appTitle
source: Bus Tracking
si: බස් ට්‍රැකින්

# loginTitle
source: Login
si: පිවිසුම

# registerTitle
source: Sign Up
si: ලියාපදිංචි වන්න

source: Email
si: විද්‍යුත් තැපෑල

source: Password
si: මුරපදය

source: Confirm Password
si: මුරපදය තහවුරු කරන්න

# loginButton
source: LOGIN
si: පිවිසෙන්න

# registerButton
source: REGISTER
si: ලියාපදිංචි වන්න

source: Full Name
si: සම්පූර්ණ නම

source: Phone Number
si: දුරකථන අංකය

source: Address
si: ලිපිනය

# loginPrompt
source: Don't have an account? Register now.
si: ගිණුමක් නොමැතිද? දැන් ලියාපදිංචි වන්න.

# registerPrompt
source: Already have an account? Login now.
si: දැනටමත් ගිණුමක් තිබේද? දැන් පිවිසෙන්න.

# passengerRole
source: Passenger
si: මගී

# driverRole
source: Driver
si: රියැදුරු

# routesTab
source: Routes
si: මාර්ග

# nearbyTab
source: Nearby
si: ආසන්නව

# profileTab
source: Profile
si: පැතිකඩ

# logoutButton
source: Logout
si: පිටවීම

# settingsTitle
source: Settings
si: සැකසුම්

# languageSettings
source: Language
si: භාෂාව

# notificationSettings
source: Notifications
si: දැනුම්දීම්

# darkModeSettings
source: Dark Mode
si: අඳුරු මාදිලිය

# searchHint
source: Search routes, stops...
si: මාර්ග, නැවතුම් සොයන්න...

# favoritesTitle
source: Favorite Routes
si: ප්‍රියතම මාර්ග

# noFavorites
source: No favorite routes yet.
si: තවම ප්‍රියතම මාර්ග නොමැත.

# nearbyRoutesTitle
source: Nearby Routes
si: ආසන්න මාර්ග

# activeVehiclesTitle
source: {count} active buses nearby
si: ආසන්නව ක්‍රියාකාරී බස් {count}

# routeDetailsTitle
source: Route Details
si: මාර්ග විස්තර

# schedulesTab
source: Schedule
si: කාලසටහන

# busesTab
source: Buses
si: බස්

# detailsTab
source: Details
si: විස්තර

# stopsTitle
source: Stops ({count})
si: නැවතුම් ({count})

source: On time
si: නියමිත වේලාවට

# minutesLate
source: {minutes} min late
si: මිනිත්තු {minutes} ප්‍රමාදයි

# minutesEarly
source: {minutes} min early
si: මිනිත්තු {minutes} කලින්

# liveLabel
source: LIVE
si: සජීවී

source: Add to favorites
si: ප්‍රියතමයන්ට එකතු කරන්න

source: Remove from favorites
si: ප්‍රියතමයන්ගෙන් ඉවත් කරන්න

source: View on map
si: සිතියමේ බලන්න

source: {distance} away
si: {distance} දුරින්

source: No routes found.
si: මාර්ග සොයාගත නොහැකි විය.

source: Error loading routes
si: මාර්ග පූරණය කිරීමේ දෝෂයකි

source: Try again
si: නැවත උත්සාහ කරන්න

# locationPermissionDenied
source: Location permission is required for this feature.
si: මෙම විශේෂාංගය සඳහා ස්ථාන අවසරය අවශ්‍ය වේ.

# locationDisabled
source: Please enable location services to use this feature.
si: මෙම විශේෂාංගය භාවිතා කිරීමට කරුණාකර ස්ථාන සේවා සක්‍රීය කරන්න.

# networkError
source: Network error. Please check your connection.
si: ජාල දෝෂය. කරුණාකර ඔබේ සම්බන්ධතාවය පරීක්ෂා කරන්න.

# offlineMode
source: You're offline. Showing cached data.
si: ඔබ ඔන්ලයින් නැත. සංචිත දත්ත පෙන්වමින්.

# unableToConnect
source: Unable to connect to server
si: සේවාදායකයට සම්බන්ධ වීමට නොහැකි විය
